/**
 * Thai Morse Code
 * @see https://morsecodeapp.com
 */

import type { Charset } from '../types.js';

const charToMorse: Record<string, string> = {
  'ก': '--.',    'ข': '-.-.', 'ค': '-.-',   'ง': '-.--.',
  'จ': '-..-.',  'ฉ': '----', 'ช': '-..-',  'ซ': '--..',
  'ญ': '.---',   'ด': '-..',  'ต': '-',     'ถ': '-.-..',
  'ท': '-..--',  'น': '-.',   'บ': '-...',  'ป': '.--.',
  'ผ': '--.-',   'ฝ': '-.-.-', 'พ': '.--.', 'ฟ': '..-.',
  'ม': '--',     'ย': '-.--', 'ร': '.-.',   'ล': '.-..',
  'ว': '.--',    'ศ': '...',  'ษ': '---..', 'ส': '...',
  'ห': '....',   'อ': '-...-', 'ฮ': '--.--',

  // Vowels & tone marks
  'ะ': '.-...',  'า': '.-',   'ิ': '..-.',  'ี': '..',
  'ึ': '..--.',  'ื': '..--', 'ุ': '..--.', 'ู': '---.',
  'เ': '.',      'แ': '.-.-', 'โ': '---',   'ไ': '.-..-',
  'ำ': '...-.',

  '่': '..-',    '้': '...-', '๊': '-...',  '๋': '.-.-.',

  '0': '-----',  '1': '.----',  '2': '..---',  '3': '...--',
  '4': '....-',  '5': '.....',  '6': '-....',  '7': '--...',
  '8': '---..',  '9': '----.',
};

const morseToChar: Record<string, string> = {};
for (const [char, morse] of Object.entries(charToMorse)) {
  morseToChar[morse] = char;
}

export const thai: Charset = {
  id: 'thai',
  name: 'Thai',
  charToMorse,
  morseToChar,
};
